{
    "chapters": [
        {
            "summary": "Karma School of Business is a podcast about the private equity industry, business best practices and real time trends. In this episode, we have an amazing conversation with Carl Press, partner with Thoma Bravo. Enjoy.",
            "gist": "Interview With Carl Press",
            "headline": "Sean Mooney: We have an amazing conversation with Carl Press",
            "start": 10680,
            "end": 56024
        },
        {
            "summary": "Originally from Chicago area, went to school to study engineering. Stumbled into finance after doing an internship in banking. Translated that into investing in private equity and investing in software companies. Leave professional sports in Chicago.",
            "gist": "Bradley Walsh on Starting Out in Private Equity",
            "headline": "You went to school to study engineering and then went into finance",
            "start": 56064,
            "end": 223636
        },
        {
            "summary": "Carl: My wife and I, we have three boys, five and under, so we are busy at home. During business school, I was one of the writers for our comedy variety show. Are you all thinking about getting the band together again?",
            "gist": "Bob Wharton on His Fun at School",
            "headline": "Carl, you have three boys, five and under",
            "start": 223780,
            "end": 435540
        },
        {
            "summary": "Carl, I'd love to learn a little bit more about where you sit in the Toma Bravo organization. We have 135 billion of assets under management and we exclusively focus on enterprise software. As the co lead of Explore, I'm actively looking for those emerging category leaders in software.",
            "gist": "In the Elevator With Toma Bravo",
            "headline": "Carl Weinberg: Toma Bravo exclusively focuses on enterprise software",
            "start": 435732,
            "end": 539540
        },
        {
            "summary": "Carl: What do you look for when you're looking at a company as a potential investment opportunity? When we meet a company, there's developing a vision for what it could be. There are some critical things we need to see in order to even attempt to go on that journey.",
            "gist": "What Do You Look For In a Company?",
            "headline": "Carl Weinberg: When we meet a company, there's developing a vision",
            "start": 539652,
            "end": 622266
        },
        {
            "summary": "There's three things we have to see in every deal that we invest in. First is a strong leader at the top. Second is is this company a category leader in whatever category it's in. Third is just really, really high quality revenue.",
            "gist": "WSJD Live: The 3 Things We Look For in Companies",
            "headline": "There are three things we have to see in every deal that we invest in",
            "start": 622290,
            "end": 727216
        },
        {
            "summary": "Trey: When you say you're looking for a strong leader, can you unpack that a little bit? Is this person driven by a passion to grow and make this company special? And is this person aligned with our vision of how to build a great company?",
            "gist": "The Search for a Strong Leader",
            "headline": "Trey: People matter even more now as we're going through major shifts",
            "start": 727320,
            "end": 1035194
        },
        {
            "summary": "Tomo Bravo puts together a four year plan that serves as a roadmap for the journey ahead between the investment team and Thoma Bravo and the management team. The hard part is when you get the business building. Visit Blue Wave@blueave. net to learn more and start a project today.",
            "gist": "How To Build a Business With Thoma Bravo",
            "headline": "Building a business is hard. Top third parties can help you create value",
            "start": 1035534,
            "end": 1422244
        },
        {
            "summary": " value creation starts before you've even made the investment. The investment is made in the first year. Your make or break moment is the first twelve months. If we get off to the wrong start, its hard to achieve our four year plan.",
            "gist": "How To Kick Off Value Creation",
            "headline": "Carl, value creation starts before you've even made the investment",
            "start": 1422584,
            "end": 1544950
        },
        {
            "summary": "A lot of companies, particularly middle market businesses, don't fully appreciate the power of data. If you're intentional and thoughtful about how you can use it, there's amazingly powerful things that you can do. The hard part is how do you keep the data clean?",
            "gist": "Middle Market Companies Need to Prioritize Data",
            "headline": "A lot of companies, particularly middle market businesses, don't fully appreciate data",
            "start": 1545102,
            "end": 1657766
        },
        {
            "summary": "Carl: What are some of the top pieces of advice that you and your colleagues are offering your portfolio companies to successfully manage through the period that we're working and living through right now. If something isn't right, fix it immediately. Sometimes done is better than perfect.",
            "gist": "Top Pieces of Advice For Our Companies",
            "headline": "Carl Icahn: We always tell our companies to fix problems immediately",
            "start": 1657910,
            "end": 2190676
        },
        {
            "summary": "If you were to come back to 22 year old Carl and give yourself a piece of advice, what's one of the things you'd share? It starts with trust your instincts more. I'll share that with my kids and we'll see if the 13 and 16 year old version of their future selves will listen.",
            "gist": "If You Had to Talk To 22 Year Old Carl",
            "headline": "If you were to go back to 22 year old Carl and give advice",
            "start": 2190820,
            "end": 2363564
        },
        {
            "summary": "Carl: My favorite investing book is the most important thing by Howard Marks. I'm a little bit of a comedy nerd. I loved born standing up by Steve Martin. Sean, what are some of the books that have had an impact on you?",
            "gist": "Books That Have Had an Impact On Me",
            "headline": "Carl Marks: My favorite investing book is the most important thing by Howard Marks",
            "start": 2364384,
            "end": 2716494
        }
    ],
    "audio_url": "https://www.listennotes.com/e/p/8cfff05e598243e29f854dc7942107ad/",
    "thumbnail": "https://cdn-images-3.listennotes.com/podcasts/private-equity-podcast-karma-school-of-hQ_6ZyY-mpk-S_ANd-rUDvt.300x300.jpg",
    "podcast_title": "Private Equity Podcast: Karma School of Business",
    "episode_title": "Private Equity Spotlight: Shaping the Future of Software with Carl Press from Thoma Bravo"
}