{
    "chapters": [
        {
            "summary": "The following is a debate with Norman Fitgenstein, Benny Morris, Moyen Rabbani, and Stephen Bonell. The goal was to explore together the history, present and future of Israel and Palestine in a free flowing conversation. For some debates, I will step in and moderate strictly to prevent emotion from boiling.",
            "gist": "A Debate on Israel and Palestine",
            "headline": "The following is a debate on the topic of Israel and Palestine",
            "start": 250,
            "end": 129720
        },
        {
            "summary": "Our sponsors include expressvpn for privacy, babble for learning new languages, PolicyGenius for insurance and aid. As always, no ads in the middle. If you skip them, please still check out our sponsors.",
            "gist": "A Special Thank You to Our Sponsors",
            "headline": "Please check out our sponsors to help support this podcast",
            "start": 130810,
            "end": 165700
        },
        {
            "summary": "This episode is brought to you by expressvpn. com. I use them to protect my privacy on the Internet. While it is true all of us value privacy, we're very hypocritical on that point. You should have several layers of protection in your digital and your physical space.",
            "gist": "How to Protect Your Privacy With VPN",
            "headline": "This episode is brought to you by expressvpn. com",
            "start": 166390,
            "end": 274340
        },
        {
            "summary": "This episode is also brought to you by Babbel, an app and website that gets you speaking in a new language. I deeply care about breaking down the barriers that language creates. For a limited time, you can get 50% off a one time payment for a lifetime Babble subscription@babel. com.",
            "gist": "Babel",
            "headline": "This episode is brought to you by Babbel, an app and website",
            "start": 275110,
            "end": 422100
        },
        {
            "summary": "This episode is also brought to you by PolicyGenius, a marketplace for insurance. You can find life insurance policies there that start at just $292 per year. For $1 million of coverage, head to policyGenius. com lex to get your free life insurance quotes.",
            "gist": "Life Insurance Quotes",
            "headline": "This episode is brought to you by PolicyGenius, a marketplace for insurance",
            "start": 423030,
            "end": 551050
        },
        {
            "summary": "Lex: I've always been able to find joy in the simplest of things. In the absence of material possessions, I always saw beauty. Every moment has the capacity to create contentment, to create real happiness. Just this feeling of gratitude to be alive is a real feeling.",
            "gist": "Thankful to Be Alive",
            "headline": "Lex Friedman: Feeling gratitude to be alive is a real feeling",
            "start": 551890,
            "end": 725070
        },
        {
            "summary": "United Nations General assembly supported partition between what it called a jewish state and an arab state. In my view, the partition resolution was the correct decision. I do not believe that the arab and jewish communities could, at that point, be made to live together.",
            "gist": " 1948",
            "headline": "First question is about 1948 and what happened in that year",
            "start": 725370,
            "end": 1008320
        },
        {
            "summary": "Benny says the two states would have been unsustainable in the long term if the zionist movement had been faithful to the position it proclaimed. He concludes that neither side was committed to the letter of the partition resolution, and both sides aborted it.",
            "gist": "Foreign Minister Gromiko at the UN",
            "headline": "Norm: Benny says Soviet foreign minister spoke movingly about 1948 partition",
            "start": 1009410,
            "end": 1728180
        },
        {
            "summary": "Wayne: A jewish state requires jewish political, demographic and territorial supremacy. He says the UN's partition resolution in 1947 did not preserve the position of each community. Palestinian society was essentially destroyed. The idea that either the Palestinians or the arab states could have accepted such a resolution is an illusion.",
            "gist": "The UN's partition of Palestine",
            "headline": "Wayne Yosef: The partition of Palestine was deeply unjust",
            "start": 1728650,
            "end": 2202480
        },
        {
            "summary": "Stephen Bonell: People like to start the history at either 47 or 48. He says there's a cherry picking of the facts where all of the blame is ascribed to Zionism. Burnell: We should acknowledge that the speaking speeds of people here are different.",
            "gist": "Phil Morris on the Israel War",
            "headline": "Stephen Burnell: Whenever people talk about 1948, there's cherry picking",
            "start": 2202850,
            "end": 2755360
        },
        {
            "summary": "Had there been no assault, there probably wouldn't have been a refugee problem. Dispossession, massive dispossession to occur. These occurred as a result of war. Transfer was never policy of the zionist movement before 47. Palestinians have never agreed to pay for their mistakes.",
            "gist": "Palestinian refugee issue",
            "headline": "Moeen says the Nakba was inevitable and predictable",
            "start": 2755730,
            "end": 3286360
        },
        {
            "summary": "A claim that gets brought up a lot has to do with the inevitability of transfer in Zionism. It's hard to truly ever know if there would have been mass transfer in the face of arab peace. Is your idea that they would have just slowly expelled them afterwards?",
            "gist": "The Entire Idea of Transfer in Zionism",
            "headline": "A claim that gets brought up about Zionism is that transfer was inevitable",
            "start": 3286810,
            "end": 3756394
        },
        {
            "summary": "How central is expulsion to Zionism in its early version of Zionism, in whatever Zionism is today? And how much power, influence does Zionism and ideology have in Israel?",
            "gist": "The Zionist ideology and Israel",
            "headline": "How central is expulsion to Zionism in its early version of Zionism",
            "start": 3756442,
            "end": 4243126
        },
        {
            "summary": "I think the Palestinians did reject the partition of their homeland in principle. The idea of establishing an exclusively jewish state at the expense of those who are already living there, I think it was right to reject that. The problem is how do you separate Palestine into two states?",
            "gist": "The Problem With the 1947 Palestine Partition Resolution",
            "headline": "You say Palestinians and Arabs would have rejected any partition resolution",
            "start": 4243238,
            "end": 4555174
        },
        {
            "summary": "Professor Morris: How could we possibly imagine that the early Israel would have engaged in the transfer of some 400,000 Arabs after accepting the partition plan? Would that not have destroyed their legitimacy in the eyes of the entire western world?",
            "gist": "Does Israel Deserve Western Nationalism?",
            "headline": "Professor Morris: Would Israel forcibly displacing Palestinians besmirch Israel in the west",
            "start": 4555222,
            "end": 5121150
        },
        {
            "summary": "Most historians of the subject agree the zionist movement was committed to the idea of a jewish state. The idea that Jews would have rejected any state that had Arabs on it is just betrayed by the acceptance of the 47 partition. There is a chasm that separates your ideology from the limits and constraints imposed by politics and reality.",
            "gist": "The Nakba: A product of war and Zionism",
            "headline": "You say the Nakba was a product of war, not design",
            "start": 5121230,
            "end": 5605258
        },
        {
            "summary": "Professor Morris says anti Semitism was not the chief motor of arab resistance to Zionism. He asks what would have happened if Jews would have lost the war in 48? What do you think would've happened to the israeli population?",
            "gist": "Phil Morris on Arab Anti-Semitism",
            "headline": "Professor Morris says anti Semitism motivated Arab resistance to Zionism",
            "start": 5605434,
            "end": 5988710
        },
        {
            "summary": "Stephen Morris: The flight of jewish people wasn't just. a mass explulsion from all the arab states. There were definitely push factors. Also pull factors. The idea that they were all expelled after 1948, that's one area. There is very little solid scholarship on what happened in 1948.",
            "gist": "Philip Morris on the Israel Problem",
            "headline": "Stephen Shalami: There is very little scholarship on what happened in 1948",
            "start": 5989870,
            "end": 6303054
        },
        {
            "summary": "The Arabs would have never accepted any jewish state whatsoever. The Arabs did their utmost to prevent jewish immigration from Europe and reaching Palestine. The world community forced the Arabs to pay the price for the Holocaust. But they also participated in various ways in helping it happen.",
            "gist": "Palestinians and the Holocaust",
            "headline": "Steven Friedman: The Arabs had nothing to do with the Holocaust",
            "start": 6303092,
            "end": 6591180
        },
        {
            "summary": "Without the british sponsorship, we wouldn't be having this discussion today. The Balfour declaration very specifically speaks about a jewish national home in Palestine. Today there is a consensus among all major human rights organizations that Israel is an apartheid state.",
            "gist": "British Sponsorship of Zionism",
            "headline": "The British sponsored Zionism for a very simple reason",
            "start": 6591550,
            "end": 6838566
        },
        {
            "summary": "We need to have it norm on the question of the responsibility of the Palestinian Arabs for the Nazi Holocaust. To somehow focus on the Palestinians strikes me as completely ridiculous. There's a perfectly understandable reason why palestinian Arabs wouldn't want Jews. I'll stick to the history, not the current propaganda.",
            "gist": "The Responsibility of the Palestinian Arabs for the Holocaust",
            "headline": "Samuel Hussey rejects claim that Palestinian Arabs were behind Nazi Holocaust",
            "start": 6838598,
            "end": 7447210
        },
        {
            "summary": "Barrack: You had a zionist organization, the Lehi, that proposed an alliance with Nazi Germany on the basis of shared ideological principle. He says trying to blame the Palestinians for the Holocaust is completely lunatic.",
            "gist": "Israel's Historian on The Lehi",
            "headline": "Yichak Shamir proposed an alliance with Nazi Germany in 1941",
            "start": 7447280,
            "end": 7694566
        },
        {
            "summary": "Haj Ameen al Husayni had as much to do with the Nazi Holocaust as I did. He was a terrorist leader of a very small, marginal group. He might have been a great further in the prevention of Jews fleeing to Palestine to escape the Holocaust.",
            "gist": "Mufti of Jerusalem: Irrelevant or irrelevant?",
            "headline": "Some claim Palestinians played an indirect role in the Holocaust",
            "start": 7694678,
            "end": 8007726
        },
        {
            "summary": "Was October 7 attacks by Hamas on Israel genocidal? Was it an act of ethnic cleansing? The ideology behind the massacre of the Jews is embedded in their charter from 819 88. Your characterization of that charter as anti Semitic is indisputable.",
            "gist": "Was October 7 attacks by Hamas on Israel genocidal?",
            "headline": "Was October 7 attacks by Hamas on Israel genocidal",
            "start": 8007828,
            "end": 8423780
        },
        {
            "summary": "There are quite a few indications in the factual record that raise serious questions about the accusations of the genocidal intent of what happened on October 7. What we need here is a proper, independent, international investigation. Israel has categorically rejected any international investigation of these things.",
            "gist": "Clinton on Israel's genocidal actions",
            "headline": "Professor Morris: Israel has categorically rejected any international investigation into October 7",
            "start": 8425210,
            "end": 8772366
        },
        {
            "summary": "Do you think the majority of the people that were killed on October 7, the civilians, were killed by Hamas? Or are we subscribing to the idea that the IDF killed hundreds?",
            "gist": "Do You Think The Majority of the People Killed in Gaza Were Killed",
            "headline": "Do you think majority of civilians killed on October 7 were killed by Hamas",
            "start": 8772398,
            "end": 8981810
        },
        {
            "summary": "The attacks of October 7, where did they land? For you, there has been almost exclusive focus on the attacks on civilian population centers and the killings of civilians on October 7. What is much less discussed is that there were very extensive attacks on israeli military and intelligence facilities. The demand and obligation of condemnation is exclusively applied to Palestinians.",
            "gist": "Sen. John McCain on Israel's Attacks on Palestinians",
            "headline": "Professor Morris: I would condemn anytime Israel deliberately attacks civilians",
            "start": 8981890,
            "end": 9247594
        },
        {
            "summary": "I have a problem with selective outrage. I have never been asked for a moral judgment on an israeli action. Illegitimate means, you condemn them, illegitimate means are not legitimate. There's no shortage of international condemnation for Israel.",
            "gist": "Israel's right to defend its citizens",
            "headline": "The focus has been very much on Hamas attacks on civilians and atrocities",
            "start": 9247632,
            "end": 9441766
        },
        {
            "summary": "Moeen: You hold high a single standard and you condemn deliberate israeli attacks on civilians when they occur. Do you think that Israel has a just cause for Operation Swords of iron? No, of course not. But let's get to those double standards.",
            "gist": "Israel and the Double Standards",
            "headline": "You hold high a single standard and you condemn deliberate Israeli attacks on civilians",
            "start": 9441788,
            "end": 9556750
        },
        {
            "summary": "Professor Morris said Israel was reluctant to harm civilians in Lebanon. He went on to acknowledge the massive use of IDF firepower against civilians during the siege of Beirut. There is not a single account of the Lebanon war that remotely approximates what Morris said. Here's a simple challenge. Answer what I'm making things up in print.",
            "gist": "Professor Morris on the Lebanon War",
            "headline": "Professor Morris says Israel was reluctant to harm civilians during Lebanon war",
            "start": 9557090,
            "end": 9946166
        },
        {
            "summary": "And if I may ask, it's good to discuss ideas that are in the air now, as opposed to citing literature that was written in the past. Condense the key idea, and then we can debate the ideas. There's a public debate, but there's also written words.",
            "gist": "In the Elevator With Historians",
            "headline": "It's good to discuss ideas that are in the air now, as opposed to",
            "start": 9946278,
            "end": 10028562
        },
        {
            "summary": "Norm Eisen: The statement that Israel might take care not to target civilians is not incompatible with a diary entry from someone who said they saw civilians getting killed. He says the false equivalency of the two sides is astounding. Eisen: Hamas targeting of civilians is different than the incidental loss of life that occurs when Israel does.",
            "gist": "Norma Criticizes Israel's Targeting of Civilians",
            "headline": "Norm Kirby: Israel is not in the business of intentionally targeting civilians",
            "start": 10028616,
            "end": 10374414
        },
        {
            "summary": "In 2018, there was the great march of return in Gaza. By all reckonings of human rights organizations and journalists who were there, it was overwhelmingly nonviolent, organized by the Hamas. Morelli: Israelis purposely deliberately targeting civilians. That's such a far fetched idea.",
            "gist": "Israel targeting civilians during the Great March of Return",
            "headline": "Morelli accuses Israel of deliberately targeting civilians during Gaza protests",
            "start": 10374462,
            "end": 10622734
        },
        {
            "summary": "And here's the funniest one of all. They targeted disabled people who were 300 meters away from the fence and just standing by trees. Nobody finds any of this hilarious. It's at the obvious joyful camaraderie in the room. So I'm enjoying it and also the joy of learning.",
            "gist": "The humor of the election",
            "headline": "They targeted disabled people who were 300 meters away from the fence",
            "start": 10622862,
            "end": 10662158
        },
        {
            "summary": "Do you think there is a policy top down from the IDF to target civilians? These are things that are signed off by multiple different layers of command. Benny Moore's never. said books are a waste of time.",
            "gist": "Israel's targeting civilians",
            "headline": "Do you think IDF has a policy top down to target civilians",
            "start": 10662244,
            "end": 10872818
        },
        {
            "summary": "There is substantial evidence that Palestinians have targeted civilians. Whether it's been incidental or systematic is a different discussion. If Israel wanted to kill civilians in Gaza, they could have killed 500,000 by now.",
            "gist": "Israel's War on Civilians",
            "headline": "Professor Morris: We're all agreed Palestinians have deliberately targeted civilians",
            "start": 10872904,
            "end": 11205370
        },
        {
            "summary": "South Africa accused Israel of perpetrating genocide in the Gaza Strip. The court is not making a determination on whether Israel has or has not committed genocide. In several years, we will have a definitive response to that question.",
            "gist": "Israel vs South Africa",
            "headline": "South Africa accused Israel of perpetrating genocide in Gaza Strip",
            "start": 11205450,
            "end": 11539654
        },
        {
            "summary": "\"It's indisputable that Israel is engaged in a genocidal assault against the palestinian people in the Gaza Strip. Genocide consists of two elements. The destruction of a people in whole or in part. And the second element is there has to be an intent \" International law is a developing organism.",
            "gist": "Israel's War on the Palestinians",
            "headline": "You specifically asked whether I think Israel is committing genocide",
            "start": 11539692,
            "end": 11827122
        },
        {
            "summary": "The plausibility standard is incredibly low. The misrepresentation that South Africa does and their case about all of these horrendous quotes, in my opinion, borders on criminal. I don't believe that those 1615 judges was 15 to 216 to two.",
            "gist": "Israel's Complaint for the ICJ",
            "headline": "Stephen Moween: The plausibility standard for ICJ case is incredibly low",
            "start": 11827256,
            "end": 12204958
        },
        {
            "summary": "Borelli: The court is not asked to determine whether South Africa's allegations of genocide are well founded. He says even reaching the benchmark of plausibility is a very high standard in the world. Borelli: It'll take a long time before the court reaches its final decision.",
            "gist": "Borelli on South Africa's Genocide Case",
            "headline": "Borelli says South Africa's allegations of genocide are not well founded",
            "start": 12205124,
            "end": 12552950
        },
        {
            "summary": "Professor Morris recommends people actually read the case and follow through a lot of the quotes that they just don't show. You can't strip the quotation of Hamas, an entity that you're at war with, and then pretend that there's genocidal intent. There are major things to discuss here.",
            "gist": "Israel vs the International Court of Justice",
            "headline": "Professor Morris: People should actually read the case and follow through quotes",
            "start": 12553030,
            "end": 12763854
        },
        {
            "summary": "There are really important things to discuss, but they will never be discussed. Instead, we're going to talk about apartheid. I have no idea what to say. I don't see any solutions. But the solution is easy.",
            "gist": "Israel and the Palestine conflict",
            "headline": "There are really important things to discuss in the Israeli-Palestinian conflict",
            "start": 12763892,
            "end": 12913466
        },
        {
            "summary": "What's your casualty count for Dariyasin? It's about 100. I think there's agreement on that by Israelis and Arabs, 105. Everybody was happy to blame the Urugun and the Lechi for killing more Arabs than actually. They put it to good use as well.",
            "gist": "What's your casualty count for Dari?",
            "headline": "There's agreement on the casualty count for Dariyasin, 105",
            "start": 12913578,
            "end": 12961840
        },
        {
            "summary": "When has Israel and Palestine been closest to a peace settlement? The closest appears to have been in 2000, when Barak and Clinton offered a two state settlement to PLO chairman Yasser Arafat. Nobody really knows why Arafat said no.",
            "gist": "When Has Israel Been Closer to a Peace Settlement?",
            "headline": "When has Israel and Palestine been closest to a peace settlement",
            "start": 12962630,
            "end": 13706190
        },
        {
            "summary": "Israel's government is probably not going anywhere. All of the other surrounding arab states have accepted that. The Palestinians need to accept it, too. It's not going to be the international community or some invocation of international law that will extricate us from this conflict.",
            "gist": "Israel and the Palestinians: Should We Have Reached Peace?",
            "headline": "Stephen Lewis looks back at past attempts to reach peace between Israelis and Palestinians",
            "start": 13707330,
            "end": 13992730
        },
        {
            "summary": "Norm: I agree with Moeen on the 73 issue. After the 1973 war, it was clear that Israel was surprised by what happened. Carter was determined to resolve the conflict on a big scale. On the palestinian issue, he wouldn't go past what he called apalestinian homeland.",
            "gist": "Moeen on the 1973 War",
            "headline": "Norm Ornstein: I agree with Moeen on 73 issue",
            "start": 13992880,
            "end": 14135366
        },
        {
            "summary": "Since roughly 1974, the Palestinians have accepted the two state settlement on the June 1967 border. Israel wants to keep all the major settlement blocks. They will not budge an inch on the question of refugees. How do we judge who is reasonable and who is not?",
            "gist": "Israel and the Palestine Problem",
            "headline": "Since roughly 1974, Palestinians have accepted the two state settlement on the June 1967 border",
            "start": 14135548,
            "end": 14618610
        },
        {
            "summary": "Israel has, along with when has international law been relevant to any conflict. That's why the Palestinians have to recognize Israel, because that's international law. But who decides what's reasonable? It's bilateral negotiations that end up shaping what the final agreements look like.",
            "gist": "Benny Moore on International Law",
            "headline": "Professor Morris: Whenever negotiations started, Palestinians kept saying international law was irrelevant",
            "start": 14619270,
            "end": 15045042
        },
        {
            "summary": "Israel would like a Palestinian, Sadat. It wants the Palestinians. Israelis want the Palestinians to accept the legitimacy of the state of Israel and then live side by side with them in two states. If that doesn't happen, there won't be a Palestinian.",
            "gist": "Moen on the Palestinian demands",
            "headline": "Sadat: Israelis want Palestinians to accept legitimacy of the state of Israel",
            "start": 15045106,
            "end": 15213118
        },
        {
            "summary": "Professor Morrison said the Palestinians could never accept Israel because they got nothing. Now we're reaching the point where according to Benny Morris, the Palestinians can't be reasonable because reasonably they have to reject two states. There's no way to resolve the problem.",
            "gist": "Morrison on the Palestinian Question",
            "headline": "Professor Morrison says Palestinians cannot accept two state settlement because it's lousy",
            "start": 15213204,
            "end": 15802534
        },
        {
            "summary": "I think that that pressure would force Israel towards an actual peace agreement. But it's never going to come through violence. Now is a good moment for both Palestine and Israel to get new leadership. Who should rise to the top such that a peaceful settlement can be reached?",
            "gist": "Israel-Palestine peace",
            "headline": "I think pressure would force Israel towards an actual peace agreement",
            "start": 15802582,
            "end": 16003740
        },
        {
            "summary": "The first principle in UN resolution two four two is that the inadmissibility of the acquisition of territory by force. How close has two, four, two gotten the Palestinians to a state? What's your alternative?",
            "gist": "Mr. Bonell on UN Resolution 2,4-2",
            "headline": "All these resolutions have gotten the Palestinians no closer, Bonell says",
            "start": 16004130,
            "end": 16160110
        },
        {
            "summary": "Professor Morris: Israel has never been prepared to concede the legitimacy of palestinian national rights in the land of the former british mandate of Palestine. Vanelle: It's the continual putting off of negotiating any solution they've negotiated. What options are left after October 7?",
            "gist": "Professor Morris on the Case for Genocide",
            "headline": "Professor Morris: Jordan didn't find it necessary to negotiate peace with Palestinian",
            "start": 16160690,
            "end": 16555150
        },
        {
            "summary": "Do you consider the Egypt israeli peace deal legitimate then, since the United States made a great financial contribution to Egypt? The core of this conflict is between Israel and the palestinian people. What was the terms of that Egypt Israel peace treaty? International law?",
            "gist": "Israel's Egypt Peace Deal",
            "headline": "Professor Morris: Do you consider the Egypt israeli peace deal legitimate",
            "start": 16558450,
            "end": 16845450
        },
        {
            "summary": "The fear of war should give people impetus to try and seek peace. Israel believes it has to restore what it calls its deterrence capability. At the very minimum, permanent ceasefire ended, inhuman and illegal blockade of Gaza. And I think that it's a zero sum game at this point.",
            "gist": "What gives you hope in the Middle East?",
            "headline": "Israel believes it has to restore its deterrence capability after October 7",
            "start": 16847150,
            "end": 17131014
        },
        {
            "summary": "According to UN reports, one quarter of the population of Gaza is starving. 500,000 children are starving. Are on the verge of famine. You use that as justification for Hamas fighting. By what metric is Gaza so behind the rest of the world?",
            "gist": "Sen. Benell on Gaza and Yemen",
            "headline": "Moen Benell: You use starvation as justification for Hamas fighting",
            "start": 17131132,
            "end": 17387442
        },
        {
            "summary": "The current situation is bleak, but what gives me hope is that the palestinian people have never surrendered. I think Israel and its leaders will have to come to the realization that by hook or by crook, these people are going to achieve their inalienable and legitimate national rights.",
            "gist": "What gives you hope about the Middle East?",
            "headline": "What gives you a source of hope about the Middle East conflict",
            "start": 17387516,
            "end": 17753958
        },
        {
            "summary": "How many people do you think were killed by Hamas on October 7? I think a clear majority, but I can't give you a specific figure. Who do you assign blame to?",
            "gist": "Norm Finkelstein on Hamas and the Israel War",
            "headline": "How many people do you think were killed by Hamas on October 7",
            "start": 17754054,
            "end": 18068430
        },
        {
            "summary": "Forget independent. A Syrian was the head of the UN Commission for Human Rights. If it wasn't israeli, it would have been okay. Really like the view of history, the passion. I'm really grateful that you would spend your really valuable time.",
            "gist": "Israel on the UN Human Rights Commission",
            "headline": "Stephen King: A Syrian was head of the UN Commission for Human Rights",
            "start": 18068590,
            "end": 18108142
        },
        {
            "summary": "Norm Fitgenstein: There's a value to preserving the record. Benny Morris: What do you hope your legacy as historians will be? Stephen Bonell: Peace is a journey of a thousand miles and it must be taken one step at a time.",
            "gist": "Legacy of Historians",
            "headline": "What do you hope your legacy as historians will be of the work",
            "start": 18108276,
            "end": 18282450
        }
    ],
    "audio_url": "https://www.listennotes.com/e/p/d4269d748da041bb84077e0d2d08d32b/",
    "thumbnail": "https://production.listennotes.com/podcasts/lex-fridman-podcast-lex-fridman-HnulBrVv9Ej-YRs7Zkd0n4l.300x300.jpg",
    "podcast_title": "Lex Fridman Podcast",
    "episode_title": "#418 – Israel-Palestine Debate: Finkelstein, Destiny, M. Rabbani & Benny Morris"
}