{
    "chapters": [
        {
            "summary": "Welcome to leverage to build wealth, where we discuss and educate entrepreneurs, mortgage, real estate and financial service professionals on how to leverage tools. Today's special guest is Dennis Torres, an adjutant professor from Pepperdine University and the author.",
            "gist": "Leverage to Build Wealth",
            "headline": "Welcome to Leverage to build wealth, where we discuss and educate entrepreneurs",
            "start": 600,
            "end": 49894
        },
        {
            "summary": "Even people who earn minimum wage can acquire financial independence. The formula is tried and true, is to live below your means and invest some of it. Ultimately that would pay off your student debt by itself.",
            "gist": "Financial Independence for Low-income people",
            "headline": "Even people who earn minimum wage can acquire financial independence, author says",
            "start": 51194,
            "end": 443914
        },
        {
            "summary": "The real intent behind it is the power of choice. The course built foundations and opened the door to my personal finance for me. Eight years later, I have paid off more than 185,000 in student loan debt. Since then, I've increased my net worth by more than $1 million.",
            "gist": "Power of Choice in Real Estate",
            "headline": "The thesis of your book is power of choice versus being forced to work",
            "start": 444414,
            "end": 693244
        },
        {
            "summary": "The book is subtitled acquiring wealth, power, success, morally and ethically. Author says he wanted to teach ethics from a standpoint of every action carries a consequence. Since retiring, he has written four books in novel form.",
            "gist": "Excerpt: Acquiring Wealth, Power, Success",
            "headline": "You've written four books since you retired from teaching",
            "start": 693284,
            "end": 973118
        },
        {
            "summary": "David Perry: I'm a big advocate for people to follow their passions, something, you know, you have to be pragmatic too, and pay your bills. But if you work at something that you're passionate about and you can produce an income to pay, you can also save a part of that. Perry: Just don't go out and buy something. You really have to know the market.",
            "gist": "Having a Financial Independence",
            "headline": "What's your rudder, what's your strength in life",
            "start": 973236,
            "end": 1425054
        },
        {
            "summary": "A car is transportation. That's one thing I've learned a lot from a lot of millionaire clients. And I wanted to bring that consciousness to the students in one of the classes I teach. How long would I have to work for the car instead of for myself?",
            "gist": "Living on a Rich Lifestyle",
            "headline": "You know, that's one thing I've learned from a lot of millionaire clients",
            "start": 1425634,
            "end": 1780856
        },
        {
            "summary": "What Cecil Rhodes did is they had a lot of diamonds in Rhodesia. He could just corner the market on it. Next step he did was convince people they had to have it. How we spend our money and how we live our lives are influenced by advertising and media.",
            "gist": "The role of diamonds in our lives",
            "headline": "Cecil Rhodes convinced people they had to have diamond engagement rings",
            "start": 1781040,
            "end": 1943254
        },
        {
            "summary": "People are still keeping up with the Joneses. They're putting it on their credit card debt. Understanding why we do things is crucial in anyone's financial strategy. Take away the social appearances of stuff and worry about building opportunities for wealth.",
            "gist": "Americans Still Want to Buy Stuff",
            "headline": "Catastast says consumers still buying despite high inflation",
            "start": 1943414,
            "end": 2423714
        },
        {
            "summary": "The go to person is the one that your boss or your company is going to say, I'll do it. You can't get to that position without trust, without loyalty, without delivering on the, on your word. If you want to be very successfully financially, you need to be that most important.",
            "gist": "Be the Go-To Person",
            "headline": "By the time I was 17, I had worked in several jobs",
            "start": 2424094,
            "end": 2587444
        },
        {
            "summary": "Dennis Torres' book is available everywhere. More important than the money, it teaches your children about money. You can contact Dennis Torres through his email address: dennis with two n's.",
            "gist": "A Few Words for Dennis Torres",
            "headline": "Tell us how our audience can reach you, how to get your book",
            "start": 2587964,
            "end": 2709156
        },
        {
            "summary": "Okay, same here. Who's next? I'm really curious. Thank you for watching and listening in to today's episode. Please, like, share and subscribe so we can strengthen our mission.",
            "gist": "How to Lever to Build Wealth",
            "headline": "This podcast is part of a series on how to leverage to build wealth",
            "start": 2709220,
            "end": 2722724
        }
    ],
    "audio_url": "https://www.listennotes.com/e/p/b85ac7cbb744468488638d139c16e9fd/",
    "thumbnail": "https://cdn-images-3.listennotes.com/podcasts/leverage-to-build-wealth-tom-bussino-n3NYhBtqule-TUd8VLtNF9l.300x300.jpg",
    "podcast_title": "Leverage To Build Wealth",
    "episode_title": "Dennis Torres, \"Personal Values & Financial Decisions,\" EPISODE 15"
}