{
    "chapters": [
        {
            "summary": "Mike Wilbah and Tony Kornheiser talk NFL combine week. See Ryan Gosling and Emily Blunt in the movie critics say exist to make you happy. In today's episode, Bryce Harper's contract, Kyler Murray's future, and Candice Parker joins us for five good minutes.",
            "gist": "Fall Guy",
            "headline": "Mike Wilbah talks NFL combine week with Tony Kornheiser",
            "start": 720,
            "end": 85566
        },
        {
            "summary": "Pistons did not get a call with 8.5 seconds left when the Knicks Dante Devicenzo barreled into Detroit. Williams called it the worst call of the year. The Knicks won this game because of that no call. Why is this game got to be in New York?",
            "gist": "Pistons' Monty Williams: The Worst Call of the",
            "headline": "Monty Williams furious after Pistons lose to Knicks on questionable foul call",
            "start": 85670,
            "end": 310714
        },
        {
            "summary": "Bryce Harper has eight years left on his 13 year, $330 million deal with the Phillies. His salary of 25 million currently puts him 29th in baseball salary. Should the Phillies even be open to negotiating an extension for Harper?",
            "gist": "Bryce Harper Is Pining for An Extension",
            "headline": "Should the Phillies even be open to negotiating an extension for Bryce Harper",
            "start": 311614,
            "end": 481956
        },
        {
            "summary": "The Arizona Cardinals posted a bunch of pictures of Kyler Murray on social media. Are they committing to Murray or are they dangling him? What should we expect when Draymond Green faces Jordan Poole tonight? All your favorite PTI episodes can be heard on Amazon Music ad free.",
            "gist": "Kyler Murray: Are the Arizona Cardinals Commit to Him?",
            "headline": "The Arizona Cardinals posted pictures of Kyler Murray yesterday on social media",
            "start": 482100,
            "end": 718662
        },
        {
            "summary": "The Warriors get Chris Paul back tonight. Draymond Green faces Jordan Pool for the first time. Caitlin Clark has a chance to stay at Iowa or go to the NBA. What would Candace Parker tell Clark about whether to stay or go?",
            "gist": "Candace Parker on Chris Paul's Return",
            "headline": "The Warriors get Chris Paul back tonight against the Wizards",
            "start": 718758,
            "end": 856224
        },
        {
            "summary": "You were on the court a couple of times when people stormed. Should it be banned? How did you feel when it happened to you? What do you think? I would like to see it continue, but in a safe manner.",
            "gist": "Kendall Hill on Court Storming",
            "headline": "Tennessee coach talks about court storming, whether it should be banned",
            "start": 857044,
            "end": 943676
        },
        {
            "summary": "Candace Parker recently re signed with the back to back WNBA champions Las Vegas Aces. She took below market money when she joined them last year. A lot of earnings as WNBA players are off the court. Still to come, bears GM Ryan polls addresses the possibility of trading your boy Justin Fields robot.",
            "gist": "Candace Parker on Her Money Talk",
            "headline": "Candace Parker recently re signed with the WNBA champions Las Vegas Aces",
            "start": 943700,
            "end": 1079454
        },
        {
            "summary": "Electric bikes come pre assembled, so you don't need to be a bike savant to ride them. Long range batteries allow riders to hit typically around 65 miles of range or up to 150 miles on some models. Bonus electric has purposefully priced their bikes to be affordably awesome.",
            "gist": "The #1 Selling E-Bike in America",
            "headline": "Electric is the number one selling e bike in America",
            "start": 1080914,
            "end": 1131560
        },
        {
            "summary": "Happy 48th birthday Tony Gonzalez, the Hall of Fame tight end for Kansas City and Atlanta. Travis Kelsey already has the most receiving yards for the Chiefs. On this day eleven years ago, Alex Smith was traded to make room for Colin Kaepernick.",
            "gist": "Tony Gonzalez's 48th Birthday",
            "headline": "Mike Gonzalez celebrates 48th birthday with a hypnotic tequila cocktail",
            "start": 1131712,
            "end": 1339864
        },
        {
            "summary": "Mexico beat the United States women's national team last night for just the second time ever. Anthony Rizzo says he's over his concussion. Have you ridden an electric e bike yet? Tonight, unranked college hoops at the new number one, Houston.",
            "gist": "Anthony Rizzo on His Concacaf Gold Cup",
            "headline": "Mexico beat United States women's national team 20-0 last night",
            "start": 1341684,
            "end": 1533304
        }
    ],
    "audio_url": "https://www.listennotes.com/e/p/111c575cead4493fabc1b38be0cb9243/",
    "thumbnail": "https://cdn-images-3.listennotes.com/podcasts/pti-espn-tony-kornheiser-michael-wilbon-dv6tGs1SpTl-LQF1ImKS-fP.300x300.jpg",
    "podcast_title": "PTI",
    "episode_title": "Candace Parker joins the show!"
}